GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/reg_map.h
/*
****************************************************************************************************************
*	Basic Notes:-
*	YouTube Reference Video: https://youtu.be/zvTd3Zxtiek
*	`uint32_t` inside every BIT struct because of padding alignment
*	`volatile` used for ensuring no further optimization by compiler
*	`: x` indicates only x bit(s) to be used from that 32-bit
****************************************************************************************************************
*                            🔧 Bit Manipulation Built-ins (GCC)
* -------------------------------------------------------------------------------------
* | Built-in Function        | Description                                           |
* |--------------------------|--------------------------------------------------------|
* | __builtin_clz(x)         | Counts leading zeros from MSB (Undefined if x == 0)   |
* | __builtin_ctz(x)         | Counts trailing zeros from LSB (Undefined if x == 0)  |
* | __builtin_popcount(x)    | Counts number of bits set to 1 (Hamming weight)       |
* | __builtin_parity(x)      | Returns 1 if number of 1-bits is odd, else 0          |
* | __builtin_ffsl(x)        | Index (1-based) of first bit set (LSB side)           |
* | __builtin_bswap16(x)     | Swaps byte order (Endian swap) for 16-bit integer     |
* | __builtin_bswap32(x)     | Swaps byte order for 32-bit integer                   |
* | __builtin_bswap64(x)     | Swaps byte order for 64-bit integer                   |
* -------------------------------------------------------------------------------------
* Notes:
* - All __builtin_* functions are evaluated at compile-time if argument is constant.
* - __builtin_clz/ctz are undefined if input is zero; guard input accordingly.
* - These generate single assembly instructions (CLZ, RBIT, etc.) on ARM Cortex-M.
* - Use with uint32_t or cast explicitly to avoid type promotion issues.
*
* Example Usage:
*   uint32_t val = 0x0000000F;
*   uint8_t zeros = __builtin_clz(val);      // → 28
*   uint8_t set   = __builtin_popcount(val); // → 4
*   uint8_t rev   = __builtin_bswap32(val);  // → 0xF0000000
*
*/

// Header Guards
#ifndef __REG_MAP_H__
#define __REG_MAP_H__

/*********************************************** Core C ***********************************************/
#include <stdint.h>
#include <string.h>
#include <stdlib.h>
/*********************************************** Core C ***********************************************/

/*********************************************** Custom Declaration ***********************************************/
#define __INLINE__ __attribute__((always_inline)) inline
#define __STATIC__ static
#define __STATIC_INLINE__ __STATIC__ __INLINE__
#define __IO volatile
#define __PACKED__ __attribute__((__packed__))

/**
 * @brief Enumeration for Success/Failure for Driver return
 */
typedef enum
{
	DRIVER_SUCCESS = (uint8_t)0x00,
	DRIVER_FAIL = (uint8_t)0x01
} driver_status_t;

/**
 * @brief Assert Status
 */
#define ASSERT_DRIVER_STATUS(status)    \
	do                                  \
	{                                   \
		if ((status) != DRIVER_SUCCESS) \
		{                               \
			return (status);            \
		}                               \
	} while (0)

/*********************************************** Custom Declaration ***********************************************/

/*********************************************** ARM CORTEX M3 ***********************************************/
#include "arm_reg_map.h"
#include "flash_reg_map.h"
#include "nvic_reg_map.h"
#include "systick_reg_map.h"
#include "wwdg_reg_map.h"
/*********************************************** ARM CORTEX M3 ***********************************************/

/*********************************************** STM32F103C8T6 ***********************************************/
#include "adc_reg_map.h"
#include "advtim_reg_map.h"
#include "afio_reg_map.h"
#include "dma_reg_map.h"
#include "exti_reg_map.h"
#include "gpio_reg_map.h"
#include "i2c_reg_map.h"
#include "timer_reg_map.h"
#include "rcc_reg_map.h"
#include "usart_reg_map.h"
/*********************************************** STM32F103C8T6 ***********************************************/

/*********************************************** Address Mapping ***********************************************/
// Memory Mapping
#define SysTick_BASE_ADDR 0xE000E010
#define NVIC_BASE_ADDR 0xE000E100
#define CPU_ID_BASE_ADDR 0xE000ED00
#define APB1_BASE_ADDR 0x40000000
#define APB2_BASE_ADDR 0x40010000
#define AHB_BASE_ADDR 0x40018000
#define FLASH_BASE_ADDR 0x40022000
#define DMA1_BASE_ADDR (AHB_BASE_ADDR + 0x00008000)
#define DMA2_BASE_ADDR (DMA1_BASE_ADDR + 0x00000400)

// Address Mapping
#define SysTick ((SysTick_TypeDef *)(SysTick_BASE_ADDR))
#define NVIC ((NVIC_TypeDef *)(NVIC_BASE_ADDR))
#define FLASH ((FLASH_REG_STRUCT *)(FLASH_BASE_ADDR))
#define WWDG ((WWDG_REG_STRUCT *)(APB1_BASE_ADDR + 0x00002C00))
#define RCC ((RCC_REG_STRUCT *)(AHB_BASE_ADDR + 0x00009000))
#define GPIOA ((GPIO_TypeDef *)(APB2_BASE_ADDR + 0x00000800))
#define GPIOB ((GPIO_TypeDef *)(APB2_BASE_ADDR + 0x00000C00))
#define GPIOC ((GPIO_TypeDef *)(APB2_BASE_ADDR + 0x00001000))
#define GPIOD ((GPIO_TypeDef *)(APB2_BASE_ADDR + 0x00001400))
#define GPIOE ((GPIO_TypeDef *)(APB2_BASE_ADDR + 0x00001800))
#define GPIOF ((GPIO_TypeDef *)(APB2_BASE_ADDR + 0x00001C00))
#define GPIOG ((GPIO_TypeDef *)(APB2_BASE_ADDR + 0x00002000))
#define AFIO ((AFIO_TypeDef *)(APB2_BASE_ADDR))
#define TIM1 ((Adv_TIM_TypeDef *)(APB2_BASE_ADDR + 0x00002C00))
#define TIM2 ((TIM_TypeDef *)(APB1_BASE_ADDR + 0x00000000))
#define TIM3 ((TIM_TypeDef *)(APB1_BASE_ADDR + 0x00000400))
#define TIM4 ((TIM_TypeDef *)(APB1_BASE_ADDR + 0x00000800))
#define TIM5 ((TIM_TypeDef *)(APB1_BASE_ADDR + 0x00000C00))
#define TIM6 ((TIM_TypeDef *)(APB1_BASE_ADDR + 0x00001000))
#define TIM7 ((TIM_TypeDef *)(APB1_BASE_ADDR + 0x00001400))
#define TIM8 ((Adv_TIM_TypeDef *)(APB2_BASE_ADDR + 0x00003400))
#define ADC1 ((ADC_TypeDef *)(APB2_BASE_ADDR + 0x00002400))
#define ADC2 ((ADC_TypeDef *)(APB2_BASE_ADDR + 0x00002800))
#define ADC3 ((ADC_TypeDef *)(APB2_BASE_ADDR + 0x00003C00))
#define USART1 ((USART_TypeDef *)(APB2_BASE_ADDR + 0x00003800))
#define USART2 ((USART_TypeDef *)(APB1_BASE_ADDR + 0x00004400))
#define USART3 ((USART_TypeDef *)(APB1_BASE_ADDR + 0x00004800))
#define EXTI ((EXTI_REG_STRUCT *)(APB2_BASE_ADDR + 0x00000400))
#define I2C1 ((I2C_TypeDef *)(APB1_BASE_ADDR + 0x00005400))
#define I2C2 ((I2C_TypeDef *)(APB1_BASE_ADDR + 0x00005800))
#define DMA1 ((DMA_TypeDef *)DMA1_BASE_ADDR)
#define DMA1_Channel1 ((DMA_Channel_TypeDef *)(DMA1_BASE_ADDR + 0x00000008))
#define DMA1_Channel2 ((DMA_Channel_TypeDef *)(DMA1_BASE_ADDR + 0x0000001C))
#define DMA1_Channel3 ((DMA_Channel_TypeDef *)(DMA1_BASE_ADDR + 0x00000030))
#define DMA1_Channel4 ((DMA_Channel_TypeDef *)(DMA1_BASE_ADDR + 0x00000044))
#define DMA1_Channel5 ((DMA_Channel_TypeDef *)(DMA1_BASE_ADDR + 0x00000058))
#define DMA1_Channel6 ((DMA_Channel_TypeDef *)(DMA1_BASE_ADDR + 0x0000006C))
#define DMA1_Channel7 ((DMA_Channel_TypeDef *)(DMA1_BASE_ADDR + 0x00000080))
#define DMA2 ((DMA_TypeDef *)DMA2_BASE_ADDR)
#define DMA2_Channel1 ((DMA_Channel_TypeDef *)(DMA2_BASE_ADDR + 0x00000008))
#define DMA2_Channel2 ((DMA_Channel_TypeDef *)(DMA2_BASE_ADDR + 0x0000001C))
#define DMA2_Channel3 ((DMA_Channel_TypeDef *)(DMA2_BASE_ADDR + 0x00000030))
#define DMA2_Channel4 ((DMA_Channel_TypeDef *)(DMA2_BASE_ADDR + 0x00000044))
#define DMA2_Channel5 ((DMA_Channel_TypeDef *)(DMA2_BASE_ADDR + 0x00000058))
/*********************************************** Address Mapping ***********************************************/

