GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/reg_map.h
/*********************************************** RCC MACROS ***********************************************/
// Generic Frequencies
#define FREQ_12Hz ((uint32_t)12)
#define FREQ_25Hz ((uint32_t)25)
#define FREQ_50Hz ((uint32_t)50)
#define FREQ_100Hz ((uint32_t)100)
#define FREQ_500Hz ((uint32_t)500)
#define FREQ_1kHz ((uint32_t)1000)
#define FREQ_2kHz ((uint32_t)2000)
#define FREQ_5kHz ((uint32_t)5000)
#define FREQ_10kHz ((uint32_t)10000)
#define FREQ_50kHz ((uint32_t)50000)
#define FREQ_72kHz ((uint32_t)72000)
#define FREQ_100kHz ((uint32_t)100000)
#define FREQ_200kHz ((uint32_t)200000)
#define FREQ_1MHz ((uint32_t)1000000)
#define FREQ_10MHz ((uint32_t)10000000)

// Clock Speed
#define HSI_FREQ ((uint32_t)8000000)
#define HSE_FREQ ((uint32_t)8000000)
#define PLL_MIN_FREQ ((uint32_t)16000000)
#define PLL_MAX_FREQ ((uint32_t)72000000)

// Clock Source
#define RCCx_SW_CLK_HSI (0x00)
#define RCCx_SW_CLK_HSE (0x01)
#define RCCx_SW_CLK_PLL (0x02)

// AHB Prescaler
#define RCCx_AHB_DIV_1 (0x00)
#define RCCx_AHB_DIV_2 (0x08)
#define RCCx_AHB_DIV_4 (0x09)
#define RCCx_AHB_DIV_8 (0x0A)
#define RCCx_AHB_DIV_16 (0x0B)
#define RCCx_AHB_DIV_64 (0x0C)
#define RCCx_AHB_DIV_128 (0x0D)
#define RCCx_AHB_DIV_256 (0x0E)
#define RCCx_AHB_DIV_512 (0x0F)

// APB1 Prescaler
#define RCCx_APB1_DIV_1 (0x03)
#define RCCx_APB1_DIV_2 (0x04)
#define RCCx_APB1_DIV_4 (0x05)
#define RCCx_APB1_DIV_8 (0x06)
#define RCCx_APB1_DIV_16 (0x07)

// APB2 Prescaler
#define RCCx_APB2_DIV_1 (0x03)
#define RCCx_APB2_DIV_2 (0x04)
#define RCCx_APB2_DIV_4 (0x05)
#define RCCx_APB2_DIV_8 (0x06)
#define RCCx_APB2_DIV_16 (0x07)

// ADC Prescaler
#define RCCx_ADC_DIV_2 (0x00)
#define RCCx_ADC_DIV_4 (0x01)
#define RCCx_ADC_DIV_6 (0x02)
#define RCCx_ADC_DIV_8 (0x03)

// PLL Clock Source
#define RCCx_PLL_SRC_HSI_DIV_2 (0x00)
#define RCCx_PLL_SRC_HSE_DIV_1 (0x01)
#define RCCx_PLL_SRC_HSE_DIV_2 (0x03)

// PLL Multiplication Factor
#define RCCx_PLL_MUL_2 (0x00)
#define RCCx_PLL_MUL_3 (0x01)
#define RCCx_PLL_MUL_4 (0x02)
#define RCCx_PLL_MUL_5 (0x03)
#define RCCx_PLL_MUL_6 (0x04)
#define RCCx_PLL_MUL_7 (0x05)
#define RCCx_PLL_MUL_8 (0x06)
#define RCCx_PLL_MUL_9 (0x07)
#define RCCx_PLL_MUL_10 (0x08)
#define RCCx_PLL_MUL_11 (0x09)
#define RCCx_PLL_MUL_12 (0x0A)
#define RCCx_PLL_MUL_13 (0x0B)
#define RCCx_PLL_MUL_14 (0x0C)
#define RCCx_PLL_MUL_15 (0x0D)
#define RCCx_PLL_MUL_16 (0x0E)

// USB Prescaler
#define RCCx_USB_DIV_1_5 (0x00)
#define RCCx_USB_DIV_1 (0x01)
/*********************************************** RCC MACROS ***********************************************/

/*********************************************** NVIC MACROS ***********************************************/
// IRQn Number
typedef uint8_t irq_t;
#define WWDG_IRQn (0)
#define PVD_IRQn (1)
#define TAMPER_IRQn (2)
#define RTC_IRQn (3)
#define FLASH_IRQn (4)
#define RCC_IRQn (5)
#define EXTI0_IRQn (6)
#define EXTI1_IRQn (7)
#define EXTI2_IRQn (8)
#define EXTI3_IRQn (9)
#define EXTI4_IRQn (10)
#define DMA1_Channel1_IRQn (11)
#define DMA1_Channel2_IRQn (12)
#define DMA1_Channel3_IRQn (13)
#define DMA1_Channel4_IRQn (14)
#define DMA1_Channel5_IRQn (15)
#define DMA1_Channel6_IRQn (16)
#define DMA1_Channel7_IRQn (17)
#define ADC1_2_IRQn (18)
#define USB_HP_CAN_TX_IRQ (19)
#define USB_LP_CAN_RX0_IRQ (20)
#define CAN_RX1_IRQ (21)
#define CAN_SCE_IRQ (22)
#define EXTI9_5_IRQn (23)
#define TIM1_BRK_IRQn (24)
#define TIM1_UP_IRQn (25)
#define TIM1_TRG_COM_IRQn (26)
#define TIM1_CC_IRQn (27)
#define TIM2_IRQn (28)
#define TIM3_IRQn (29)
#define TIM4_IRQn (30)
#define I2C1_EV_IRQn (31)
#define I2C1_ER_IRQn (32)
#define I2C2_EV_IRQn (33)
#define I2C2_ER_IRQn (34)
#define SPI1_IRQn (35)
#define SPI2_IRQn (36)
#define USART1_IRQn (37)
#define USART2_IRQn (38)
#define USART3_IRQn (39)
#define EXTI15_10_IRQn (40)
#define RTC_Alarm_IRQn (41)
#define ADC3_IRQn (47)
#define DMA2_Channel1_IRQn (56)
#define DMA2_Channel2_IRQn (57)
#define DMA2_Channel3_IRQn (58)
#define DMA2_Channel4_5_IRQn (59)
/*********************************************** NVIC MACROS ***********************************************/

/*********************************************** I2C MACROS ***********************************************/
// I2C Speed
#define I2Cx_SPEED_STD (FREQ_100kHz)
#define I2Cx_SPEED_FAST (FREQ_100kHz << 2)
// I2C SCL Clock Frequency
#define I2Cx_SCL_FREQ_4MHz (0x04)
#define I2Cx_SCL_FREQ_8MHz (0x08)
#define I2Cx_SCL_FREQ_16MHz (0x10)
#define I2Cx_SCL_FREQ_32MHz (0x20)
#define I2Cx_SCL_FREQ_DEFAULT RCC_Get_APB1Clock()
// I2C Mode
#define I2Cx_MODE_STD (0x00)
#define I2Cx_MODE_FAST (0x01)
// I2C Interrupt Mapping
#define I2Cx_IRQ_EVENT (0x01)
#define I2Cx_IRQ_BUFFER (0x02)
#define I2Cx_IRQ_ERROR (0x04)
#define I2Cx_IRQ_ALL (I2Cx_IRQ_EVENT | I2Cx_IRQ_BUFFER | I2Cx_IRQ_ERROR)
// I2C Fast Mode Duty
#define I2Cx_DUTY_NORMAL (0x00)
#define I2Cx_DUTY_FAST (0x01)
// I2C Slave R/W Definitions
#define I2Cx_WRITE (0x00)
#define I2Cx_READ (0x01)
// I2C Peripheral Definitions
#define I2C1_SCL_GPIO (GPIOB)
#define I2C1_SCL_PIN (GPIOx_PIN_6)
#define I2C1_SDA_GPIO (GPIOB)
#define I2C1_SDA_PIN (GPIOx_PIN_7)
#define I2C2_SCL_GPIO (GPIOB)
#define I2C2_SCL_PIN (GPIOx_PIN_10)
#define I2C2_SDA_GPIO (GPIOB)
#define I2C2_SDA_PIN (GPIOx_PIN_11)
/*********************************************** I2C MACROS ***********************************************/

/*********************************************** SysTick MACROS ***********************************************/
// SysTick Clock Selection
#define SYSTICK_CLK_EXT (0x00)
#define SYSTICK_CLK_CORE (0x01)

// SysTick Delay
#define SYSTICK_DELAY_1_US (RCC_Get_AHBClock())
#define SYSTICK_DELAY_2_US (SYSTICK_DELAY_1_US << 1)
#define SYSTICK_DELAY_1_MS (SYSTICK_DELAY_1_US / FREQ_1kHz)
#define SYSTICK_DELAYS_2_MS (SYSTICK_DELAY_1_MS << 1)
/*********************************************** SysTick MACROS ***********************************************/

/*********************************************** Timer MACROS ***********************************************/
// - Prescaler
// |-> Timer Frequency: 10kHz
// |-> (PSC + 1) = (7199 + 1) = (7200)
#define TIMx_DEFAULT_10kHz_PSC ((uint16_t)7199)
// - Max Count Value
// |-> Timer Frequency: 10kHz
// |-> (ARR + 1) = (9999 + 1) = (10000)
#define TIMx_DEFAULT_10kHz_ARR ((uint16_t)9999)
// - Prescaler
// |-> Timer Frequency: 1MHz
// |-> (PSC + 1) = (71 + 1) = (72)
#define TIMx_DEFAULT_1MHz_PSC ((uint16_t)71)
// - Max Count Value
// |-> Timer Frequency: 10kHz
// |-> (ARR + 1) = (999 + 1) = (1000)
#define TIMx_DEFAULT_1MHz_ARR ((uint16_t)999)
// Timer Start Value
#define TIMx_DEFAULT_CNT ((uint16_t)0)

// Clock Division
#define TIMx_CKD_CLK_FREQ (0x00)
#define TIMx_CKD_CLK_2_FREQ (0x01)
#define TIMx_CKD_CLK_4_FREQ (0x02)

