GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/reg_map.h
// ADC Data Alignment
#define ADC_DATA_ALIGN_RIGHT (0)
#define ADC_DATA_ALIGN_LEFT (1)

// ADC IRQ
#define ADCx_IRQ_DISABLE (0)
#define ADCx_IRQ_ENABLE (1)

// ADC Sample Time Channel Decoding
#define ADC_SAMPLE_CHANNEL(ADC_SAMPLEx) ((uint8_t)(((ADC_SAMPLEx) & 0xF0) >> 4))
// ADC Sample Time Decoding
#define ADC_SAMPLE_TIME(ADC_SAMPLEx) ((uint8_t)((ADC_SAMPLEx) & 0x0F))

/*********************************************** ADC MACROS ***********************************************/

/*********************************************** USART MACROS ***********************************************/
// TX
#define USARTx_TX_DISABLE (0x00)
#define USARTx_TX_ENABLE (0x01)

// RX
#define USARTx_RX_DISABLE (0x00)
#define USARTx_RX_ENABLE (0x01)

// TX Empty IRQ
#define USARTx_TXEIE_DISABLE (0x00)
#define USARTx_TXEIE_ENABLE (0x01)

// RX Not Empty IRQ
#define USARTx_RXNEIE_DISABLE (0x00)
#define USARTx_RXNEIE_ENABLE (0x01)

// TX Complete IRQ
#define USARTx_TCIE_DISABLE (0x00)
#define USARTx_TCIE_ENABLE (0x01)

// Parity Control
#define USARTx_PARITY_DISABLE (0x00)
#define USARTx_PARITY_ENABLE (0x01)

// Word Length
#define USARTx_WORD_8_BITS (0x00)
#define USARTx_WORD_9_BITS (0x01)

// Stop Bits
#define USARTx_STOP_1_BIT (0x00)
#define USARTx_STOP_0_5_BITS (0x01)
#define USARTx_STOP_2_BITS (0x02)
#define USARTx_STOP_1_5_BITS (0x03)

// Parity Mode
#define USARTx_PARITY_EVEN (0x00)
#define USARTx_PARITY_ODD (0x01)

// Baud Rate
#define USARTx_BAUD_4800 ((uint16_t)4800)
#define USARTx_BAUD_9600 ((uint16_t)9600)
#define USARTx_BAUD_115200 ((uint16_t)115200)

// Local Delay
#define USARTx_STRING_TX_DELAY ((uint16_t)3000)
/*********************************************** USART MACROS ***********************************************/

/*********************************************** DMA MACROS ***********************************************/
// DMA Direction
#define DMAx_DIR_READ_PER (0x00)
#define DMAx_DIR_READ_MEM (0x01)

// Memory to Memory Transfer
#define DMAx_MEM2MEM_DISABLE (0x00)
#define DMAx_MEM2MEM_ENABLE (0x01)

// Circular Mode
#define DMAx_CIRC_DISABLE (0x00)
#define DMAx_CIRC_ENABLE (0x01)

// Priority Level
#define DMAx_PRIORITY_LOW (0x00)
#define DMAx_PRIORITY_MEDIUM (0x01)
#define DMAx_PRIORITY_HIGH (0x02)
#define DMAx_PRIORITY_VERY_HIGH (0x03)

// Address Increment
#define DMAx_INC_DISABLE (0x00)
#define DMAx_INC_ENABLE (0x01)

// DMA Data Size for Transfer
#define DMAx_DATA_SIZE_BIT_8 (0x00)
#define DMAx_DATA_SIZE_BIT_16 (0x01)
#define DMAx_DATA_SIZE_BIT_32 (0x02)

// Interrupts
#define DMAx_IRQ_DISABLE (0x00)
#define DMAx_IRQ_ENABLE (0x01)

// DMA Channel 6
#define DMA_USART2_RX (DMA1_Channel6)
#define DMA_I2C1_TX (DMA1_Channel6)
#define DMA_TIM1_CH3 (DMA1_Channel6)
#define DMA_TIM3_CH1 (DMA1_Channel6)
#define DMA_TIM3_TRIG (DMA1_Channel6)

// DMA Channel 7
#define DMA_USART2_TX (DMA1_Channel7)
#define DMA_I2C1_RX (DMA1_Channel7)
#define DMA_TIM2_CH2 (DMA1_Channel7)
#define DMA_TIM2_CH4 (DMA1_Channel7)
#define DMA_TIM4_UP (DMA1_Channel7)

/*********************************************** DMA MACROS ***********************************************/

/*********************************************** Helper Functions ***********************************************/
// Size of an array
#define SIZEOF(X) (sizeof((X)) / sizeof((X)[0]))

/**
 * @brief Check if a number is a power of 2
 * @param num The number to check
 * @returns 0: Not a power of 2
 * @returns 1: Power of 2
 */
__STATIC_INLINE__ uint8_t Is_Power_Of_2(uint16_t num)
{
	// Check if the number is a power of two
	return (num && (!(num & (num - 1))));
}

/**
 * @brief Rounds up a number to the next power of 2
 * @param n The number to round up
 * @return Rounded up power of 2
 */
__STATIC_INLINE__ uint16_t Logical_Round_Up_Power_Of_2(uint16_t n)
{
	// Input = 0 -> Output = 1
	if (n == 0)
		return 1;
	// Step 1: Subtract 1 to handle exact powers of 2
	n--;
	// Step 2: Propagate highest bit to the right
	// NOTE: No need for >>16 because uint16_t is only 16 bits
	n |= n >> 1;
	n |= n >> 2;
	n |= n >> 4;
	n |= n >> 8;
	// Step 3: Add 1 to get the next power of 2
	return n + 1;
}

/**
 * @brief Rounds up a number to the next power of 2
 * @param n The number to round up
 * @return Rounded up power of 2
 */
__STATIC_INLINE__ uint32_t Round_Up_Power_of_2(uint32_t x)
{
	// If x is 0, return 1 (2^0)
	if (x == 0)
		return 0x00000001;
	/**
	 * 		Expression						Meaning
	 *		__builtin_clz(x)				Count leading zeros of 32-bit integer
	 * 		32 - __builtin_clz(x)			log₂(x) rounded up to nearest power
	 * 		1 << (32 - __builtin_clz(x))	Next power of 2
	 *  NOTE: clz() returns 32 for input 0, which is undefined behavior — so we always use (size - 1) to avoid that
	 */
	// Calculate the next power of 2 greater than or equal to x
	return (1 << (32 - __builtin_clz(x - 1)));
}

/*********************************************** Helper Functions ***********************************************/

#endif /* __REG_MAP_H__ */